Revit 2026 API

# PipeFittingAndAccessoryPressureDropUIData Properties

---

The PipeFittingAndAccessoryPressureDropUIData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

PipeFittingAndAccessoryPressureDropUIData Class

Autodesk.Revit.UI.Plumbing Namespace